{
    "experience": {
        "title": "Experience",
        "jobs": [
            {
                "title": "Senior Software Engineer",
                "company": "Microsoft - Turn 10 Studios",
                "location": "Remote",
                "dates": "2022 - Present",
                "logo": "t10_logo_white.svg",
                "logo_alt": "Turn 10 Studios Logo",
                "description": [
                    "Technical lead for a small strike team focused on polishing the game for ship. Worked across the team to address ship quality issues such as hitches, screen flashes, and UI transition problems.",
                    "Extended previously built progression systems to easily add Xbox and Steam achievements to the game. Supported external partners in implementing the achievements using the new system.",
                    "Worked with the services team to optimize on-track server calls to help ensure scalability for worldwide release."
                ]
            },
            {
                "title": "Software Engineer II",
                "company": "Microsoft - Turn 10 Studios",
                "location": "Redmond, WA / Remote",
                "dates": "2019 - 2022",
                "logo": "t10_logo_white.svg",
                "logo_alt": "Turn 10 Studios Logo",
                "description": [
                    "Drove technical designs and discussions around player progression. Built game systems that interact with the services backend to track progression, game challenges, and rewarding in-game currency and items.",
                    "Prototyped player customization of the Forza home space that ultimately did not ship. Worked across design, cinematics, UI, game systems, and rendering to deliver a novel approach to the player's home space.",
                    "Worked with the UI art lead to prototype his vision for novel internal UI tooling that makes handoffs between the UI art team and UI developers easier. Prepared and documented system for handoff for continued development to external partners."
                ]
            },
            {
                "title": "Software Engineer II",
                "company": "Microsoft - Xbox Live",
                "location": "Redmond, WA",
                "dates": "2017 - 2019",
                "logo": "xbox_logo.svg",
                "logo_alt": "Xbox Logo",
                "description": [
                    "Built and maintained frontend for Web SISU, a new sign in / sign up web flow aimed at expanding Xbox Live beyond the console to mobile platforms and Win32.",
                    "Built various test apps and prototypes for new Xbox Auth Library (Xal) and XSAPI, including the Win32 test app the Xal team relies on daily for testing.",
                    "Feature work and bug fixes supporting monthly releases for Xal."
                ]
            },
            {
                "title": "Freelance Programmer",
                "company": "Self-Employed",
                "location": "San Diego, CA",
                "dates": "2016-2017",
                "logo": "",
                "description": [
                    "Responsible for implementing the multiplayer mode for a GearVR title in Unity3D.",
                    "Implemented asynchronous turn-based gameplay using Photon Realtime and a custom node.js endpoint hosted on Heroku."
                ]
            },
            {
                "title": "Software Engineer",
                "company": "Pocketwatch Games",
                "location": "San Diego, CA",
                "dates": "2014-2016",
                "logo": "pwg-logo.svg",
                "logo_alt": "Pocketwatch Games Logo",
                "description": [
                    "Technical ownership of UI architecture and implementation for a real-time strategy game in XNA.",
                    "Gameplay programming and debugging with special attention to the pitfalls of lock-step networking.",
                    "Significantly reduced deployment times by automating the build pipeline using Slack and Hubot."
                ]
            },
            {
                "title": "Solutions Engineer",
                "company": "Provide Commerce",
                "location": "San Diego, CA",
                "dates": "2014",
                "logo": "",
                "description": [
                    "Frontend and backend web development using ASP.NET MVC and LESS to support major responsive overhaul to ProFlowers order process pages.",
                    "Architecture and development on QA automation platform using Selenium and Visual Studio. Implemented Page-Object model to create reusable test-platform for web regression testing."
                ]
            },
            {
                "title": "Programmer Analyst",
                "company": "UC San Diego Division of Biomedical Informatics",
                "location": "San Diego, CA",
                "dates": "2012-2014",
                "logo": "ucsd_seal.svg",
                "logo_alt": "Seal of the University of California, San Diego",
                "description": [
                    "Co-Author: “MAGI: a Node.js web service for fast microRNA-Seq analysis in a GPU infrastructure.” Bioinformatics 2014; 30 (19): 2826-2827."
                ]
            }
        ],
        "credits": [
            {
                "title": "Skylight",
                "year": "2017",
                "credit": "Multiplayer Programmer",
                "logo": "skylight_logo.webp",
                "logo_alt": "Logo of Skylight"
            },
            {
                "title": "Tooth and Tail",
                "year": "2017",
                "credit": "Additional Programming",
                "logo": "tnt_logo.png",
                "logo_alt": "Logo of Tooth and Tail"
            }
        ]
    }
}
